# Pandas DataFrame basics

In [1]:
import pandas as pd
import numpy as np

In [2]:
oil = pd.read_csv("../pandas-course/Pandas Course Resources/retail/oil.csv")

In [3]:
oil.shape

(1218, 2)

In [4]:
oil.size

2436

In [5]:
oil.index

RangeIndex(start=0, stop=1218, step=1)

In [6]:
oil.columns

Index(['date', 'dcoilwtico'], dtype='object')

In [7]:
oil.axes

[RangeIndex(start=0, stop=1218, step=1),
 Index(['date', 'dcoilwtico'], dtype='object')]

In [8]:
oil.head()

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20

In [9]:
oil.tail()

            date  dcoilwtico
1213  2017-08-25       47.65
1214  2017-08-28       46.40
1215  2017-08-29       46.46
1216  2017-08-30       45.96
1217  2017-08-31       47.26

In [10]:
oil.sample(10)

            date  dcoilwtico
503   2014-12-05       65.89
1063  2017-01-27       53.18
303   2014-02-28      102.88
156   2013-08-07      104.41
784   2016-01-04       36.81
240   2013-12-03       95.83
115   2013-06-11       95.50
527   2015-01-08       48.80
989   2016-10-17       49.97
997   2016-10-27       49.71

In [11]:
oil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1218 non-null   object
 1   dcoilwtico  1175 non-null   float64
dtypes: float64(1), object(1)
memory usage: 19.2+ KB

In [12]:
oil.describe()

        dcoilwtico
count  1175.000000
mean     67.714366
std      25.630476
min      26.190000
25%      46.405000
50%      53.190000
75%      95.660000
max     110.620000

Course assignment: exploring DataFrames

In [13]:
df = pd.read_csv("../pandas-course/Pandas Course Resources/retail/transactions.csv")

In [14]:
print(df.shape[0])
print(df.columns)
print(df.dtypes)

83488
Index(['date', 'store_nbr', 'transactions'], dtype='object')
date            object
store_nbr        int64
transactions     int64
dtype: object

In [15]:
df.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  object
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB

In [17]:
df.loc[:,"date"].nunique()

1682

In [18]:
df.loc[:,"transactions"].describe()

count    83488.000000
mean      1694.602158
std        963.286644
min          5.000000
25%       1046.000000
50%       1393.000000
75%       2079.000000
max       8359.000000
Name: transactions, dtype: float64

In [19]:
df.loc[:,[col for col in df.columns if col != "date"]]

       store_nbr  transactions
0             25           770
1              1          2111
2              2          2358
3              3          3487
4              4          1922
...          ...           ...
83483         50          2804
83484         51          1573
83485         52          2255
83486         53           932
83487         54           802

[83488 rows x 2 columns]

In [20]:
df.loc[:,"store_nbr"].nunique()

54

In [21]:
str(round((df["transactions"].sum()/1_000_000),1)) + " milion"

'141.5 milion'

In [22]:
df.drop(labels=[col for col in df.columns if "o"  in col],axis=1)

             date
0      2013-01-01
1      2013-01-02
2      2013-01-02
3      2013-01-02
4      2013-01-02
...           ...
83483  2017-08-15
83484  2017-08-15
83485  2017-08-15
83486  2017-08-15
83487  2017-08-15

[83488 rows x 1 columns]

In [23]:
df.duplicated(subset="date")

0        False
1        False
2         True
3         True
4         True
         ...
83483     True
83484     True
83485     True
83486     True
83487     True
Length: 83488, dtype: bool

In [24]:
df.shape[0] / df.drop_duplicates(subset="date").duplicated(subset="date").size

49.63614744351962

In [25]:
df.shape[0] / df["date"].nunique()

49.63614744351962

In [26]:
df

             date  store_nbr  transactions
0      2013-01-01         25           770
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83488 rows x 3 columns]

In [27]:
df.drop(labels=[0],inplace=True)

In [28]:
df.drop(labels="date",axis=1)

       store_nbr  transactions
1              1          2111
2              2          2358
3              3          3487
4              4          1922
5              5          1903
...          ...           ...
83483         50          2804
83484         51          1573
83485         52          2255
83486         53           932
83487         54           802

[83487 rows x 2 columns]

In [29]:
df.drop_duplicates(subset="store_nbr",keep="last").head()

             date  store_nbr  transactions
83434  2017-08-15          1          1693
83435  2017-08-15          2          1737
83436  2017-08-15          3          2956
83437  2017-08-15          4          1283
83438  2017-08-15          5          1310

In [30]:
oil.isna().sum()

date           0
dcoilwtico    43
dtype: int64

In [31]:
oil.dropna(subset="dcoilwtico")

            date  dcoilwtico
1     2013-01-02       93.14
2     2013-01-03       92.97
3     2013-01-04       93.12
4     2013-01-07       93.20
5     2013-01-08       93.21
...          ...         ...
1213  2017-08-25       47.65
1214  2017-08-28       46.40
1215  2017-08-29       46.46
1216  2017-08-30       45.96
1217  2017-08-31       47.26

[1175 rows x 2 columns]

In [32]:
oil.isna().sum()

date           0
dcoilwtico    43
dtype: int64

In [33]:
oil.fillna({"dcoilwtico":0})["dcoilwtico"].mean()

65.32379310344828

In [34]:
oil["dcoilwtico"].mean()

67.71436595744682

In [35]:
store25 = df.loc[df["store_nbr"] == 25]

In [36]:
df.groupby(["date","store_nbr"])["transactions"].sum() > 2000

date        store_nbr
2013-01-02  1             True
            2             True
            3             True
            4            False
            5            False
                         ...
2017-08-15  50            True
            51           False
            52            True
            53           False
            54           False
Name: transactions, Length: 83487, dtype: bool

In [37]:
(df["transactions"] > 2000).value_counts(normalize=True).loc[True]

0.266808006036868

In [38]:
store25.loc[store25["transactions"] > 2000,"transactions"].sum()

144903

In [39]:
df.loc[(df["store_nbr"].isin([25,31])) & (df["date"].str.slice(-5,-3).isin(["05","06"])) & (df["transactions"] < 2000),"transactions"].sum()

644910

In [40]:
df["date"].str.slice(-4,-3)

1        1
2        1
3        1
4        1
5        1
        ..
83483    8
83484    8
83485    8
83486    8
83487    8
Name: date, Length: 83487, dtype: object

In [41]:
df

             date  store_nbr  transactions
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
5      2013-01-02          5          1903
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83487 rows x 3 columns]

In [42]:
df2 = df.copy()
df2.loc[df["date"] == "2013-01-01"] = 2001
df2.groupby("date").apply(lambda x: (x["transactions"] > 2000).all(), include_groups=False)

date
2013-01-02    False
2013-01-03    False
2013-01-04    False
2013-01-05    False
2013-01-06    False
              ...
2017-08-11    False
2017-08-12    False
2017-08-13    False
2017-08-14    False
2017-08-15    False
Length: 1681, dtype: bool

In [43]:
df.groupby("store_nbr")["transactions"].sum()

store_nbr
1     2553963
2     3219901
3     5366350
4     2519007
5     2347877
6     3065896
7     2995993
8     4637971
9     3516162
10    1652493
11    3972488
12    1958852
13    1572504
14    2287850
15    2209898
16    1464498
17    2295485
18    2071278
19    2107489
20    1422539
21     842891
22     504156
23    1788171
24    3568206
25    1519592
26    1065059
27    2485687
28    1957594
29     981448
30    1171130
31    2306044
32    1065226
33    1743003
34    3864018
35    1123889
36    1738129
37    2481719
38    2867052
39    2389482
40    2181195
41    1764146
42     802646
43    2182356
44    7273093
45    6201115
46    5990113
47    6535810
48    5107785
49    4574103
50    4384444
51    2873614
52     275393
53    1180082
54    1451290
Name: transactions, dtype: int64

In [44]:
df.sort_values(by=["transactions"],ascending=False)[["date","transactions"]]

             date  transactions
52011  2015-12-23          8359
71010  2016-12-23          8307
16570  2013-12-23          8256
33700  2014-12-23          8120
16572  2013-12-23          8001
...           ...           ...
58003  2016-04-18            54
57950  2016-04-17            33
52428  2016-01-04            10
52392  2016-01-02             6
65479  2016-09-07             5

[83487 rows x 2 columns]

In [45]:
df.sort_values(by=["date","transactions"], ascending=[True,False])

             date  store_nbr  transactions
40     2013-01-02         46          4886
38     2013-01-02         44          4821
39     2013-01-02         45          4208
41     2013-01-02         47          4161
11     2013-01-02         11          3547
...           ...        ...           ...
83455  2017-08-15         22           766
83449  2017-08-15         16           742
83465  2017-08-15         32           615
83468  2017-08-15         35           612
83459  2017-08-15         26           534

[83487 rows x 3 columns]

In [46]:
df.sort_index(axis=1, ascending=False)

       transactions  store_nbr        date
1              2111          1  2013-01-02
2              2358          2  2013-01-02
3              3487          3  2013-01-02
4              1922          4  2013-01-02
5              1903          5  2013-01-02
...             ...        ...         ...
83483          2804         50  2017-08-15
83484          1573         51  2017-08-15
83485          2255         52  2017-08-15
83486           932         53  2017-08-15
83487           802         54  2017-08-15

[83487 rows x 3 columns]

In [47]:
df.columns = [col.capitalize() for col in df.columns]

In [48]:
df.rename(columns= lambda x: x.upper())

             DATE  STORE_NBR  TRANSACTIONS
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
5      2013-01-02          5          1903
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83487 rows x 3 columns]

In [50]:
s = list(df.columns)
np.random.shuffle(s)
s

['Date', 'Store_nbr', 'Transactions']

In [51]:
df.rename(columns={"Store_nbr":"Store_number","Transactions":"Transactions_count"}, inplace= True)

In [52]:
df = df.reindex(columns=["Date","Transactions_count","Store_number"])

In [53]:
df["pct_to_target"] = df["Transactions_count"]/2500
df["met_target"] = df["pct_to_target"] >= 1
df["bonus_payable"] = df["met_target"].map({True:100,False:0})

In [54]:
df.head()

,Date,Transactions_count,Store_number,pct_to_target,met_target,bonus_payable
1,2013-01-02,2111,1,0.8444,False,0
2,2013-01-02,2358,2,0.9432,False,0
3,2013-01-02,3487,3,1.3948,True,100
4,2013-01-02,1922,4,0.7688,False,0
5,2013-01-02,1903,5,0.7612,False,0

In [55]:
df["bonus_payable"].sum()

1448300

In [56]:
df["month"] = df["Date"].str[5:7].astype(int)  # Converts "01" to 1, "02" to 2, etc.
df["day"] = df["Date"].str[8:10].astype(int)   # Converts "01" to 1, "02" to 2, etcc

In [57]:
df.drop(columns="day",inplace=True)

In [58]:
df.head()

,Date,Transactions_count,Store_number,pct_to_target,met_target,bonus_payable,month
1,2013-01-02,2111,1,0.8444,False,0,1
2,2013-01-02,2358,2,0.9432,False,0,1
3,2013-01-02,3487,3,1.3948,True,100,1
4,2013-01-02,1922,4,0.7688,False,0,1
5,2013-01-02,1903,5,0.7612,False,0,1

In [60]:
df.head()

,Date,Transactions_count,Store_number,pct_to_target,met_target,bonus_payable,month
1,2013-01-02,2111,1,0.8444,False,0,1
2,2013-01-02,2358,2,0.9432,False,0,1
3,2013-01-02,3487,3,1.3948,True,100,1
4,2013-01-02,1922,4,0.7688,False,0,1
5,2013-01-02,1903,5,0.7612,False,0,1

In [61]:
con = [
    pd.to_datetime(df["Date"]).dt.month == 12,
    (pd.to_datetime(df["Date"]).dt.month == 5) &  (pd.to_datetime(df["Date"]).dt.day_of_week == 6),
    (pd.to_datetime(df["Date"]).dt.month == 7) &  (pd.to_datetime(df["Date"]).dt.day_of_week == 0)
]
values = [
    "Holiday Bonus", "Corporate Month", "Summer Special"
]
df["seasonal_bonus"] = pd.Series(np.select(con,values,default=None))

In [62]:
df.loc[(~df["seasonal_bonus"].isna())].shape[0]*100

822900

In [63]:
df["seasonal_bonus"].value_counts(dropna=False).iloc[1:].sum()*100

823000

In [64]:
df

,Date,Transactions_count,Store_number,pct_to_target,met_target,bonus_payable,month,seasonal_bonus
1,2013-01-02,2111,1,0.8444,False,0,1,None
2,2013-01-02,2358,2,0.9432,False,0,1,None
3,2013-01-02,3487,3,1.3948,True,100,1,None
4,2013-01-02,1922,4,0.7688,False,0,1,None
5,2013-01-02,1903,5,0.7612,False,0,1,None
...,...,...,...,...,...,...,...,...
83483,2017-08-15,2804,50,1.1216,True,100,8,None
83484,2017-08-15,1573,51,0.6292,False,0,8,None
83485,2017-08-15,2255,52,0.9020,False,0,8,None
83486,2017-08-15,932,53,0.3728,False,0,8,None
83487,2017-08-15,802,54,0.3208,False,0,8,NaN

In [65]:
df.head()

,Date,Transactions_count,Store_number,pct_to_target,met_target,bonus_payable,month,seasonal_bonus
1,2013-01-02,2111,1,0.8444,False,0,1,None
2,2013-01-02,2358,2,0.9432,False,0,1,None
3,2013-01-02,3487,3,1.3948,True,100,1,None
4,2013-01-02,1922,4,0.7688,False,0,1,None
5,2013-01-02,1903,5,0.7612,False,0,1,None

In [66]:
# df.drop(columns=df.columns[3:],inplace=True)

In [67]:
pd.Series([12,30,3],dtype="Int64").memory_usage(deep=True)

159

In [68]:
pd.Series([12,30,np.nan],dtype="object").memory_usage(deep=True)

236

In [69]:
pd.Series([12,30,3],dtype="int64").memory_usage(deep=True)

156

In [70]:
pd.Series([12,30,-1],dtype="int8").memory_usage(deep=True)

135

In [71]:
pd.Series([12,30,-1],dtype="int8").info()

<class 'pandas.core.series.Series'>
RangeIndex: 3 entries, 0 to 2
Series name: None
Non-Null Count  Dtype
--------------  -----
3 non-null      int8
dtypes: int8(1)
memory usage: 135.0 bytes

In [72]:
(df.memory_usage(deep=True)/1024/1024).sum()

10.555562019348145

In [73]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83487 entries, 1 to 83487
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Date                83487 non-null  object
 1   Transactions_count  83487 non-null  int64
 2   Store_number        83487 non-null  int64
 3   pct_to_target       83487 non-null  float64
 4   met_target          83487 non-null  bool
 5   bonus_payable       83487 non-null  int64
 6   month               83487 non-null  int32
 7   seasonal_bonus      8229 non-null   object
dtypes: bool(1), float64(1), int32(1), int64(3), object(2)
memory usage: 4.2+ MB

In [74]:
df.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83487 entries, 1 to 83487
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Date                83487 non-null  object
 1   Transactions_count  83487 non-null  int64
 2   Store_number        83487 non-null  int64
 3   pct_to_target       83487 non-null  float64
 4   met_target          83487 non-null  bool
 5   bonus_payable       83487 non-null  int64
 6   month               83487 non-null  int32
 7   seasonal_bonus      8229 non-null   object
dtypes: bool(1), float64(1), int32(1), int64(3), object(2)
memory usage: 10.6 MB

In [75]:
df.head()

,Date,Transactions_count,Store_number,pct_to_target,met_target,bonus_payable,month,seasonal_bonus
1,2013-01-02,2111,1,0.8444,False,0,1,None
2,2013-01-02,2358,2,0.9432,False,0,1,None
3,2013-01-02,3487,3,1.3948,True,100,1,None
4,2013-01-02,1922,4,0.7688,False,0,1,None
5,2013-01-02,1903,5,0.7612,False,0,1,None

In [76]:
df = df.astype({"Date":"datetime64[ns]"})

In [77]:
df.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83487 entries, 1 to 83487
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Date                83487 non-null  datetime64[ns]
 1   Transactions_count  83487 non-null  int64
 2   Store_number        83487 non-null  int64
 3   pct_to_target       83487 non-null  float64
 4   met_target          83487 non-null  bool
 5   bonus_payable       83487 non-null  int64
 6   month               83487 non-null  int32
 7   seasonal_bonus      8229 non-null   object
dtypes: bool(1), datetime64[ns](1), float64(1), int32(1), int64(3), object(1)
memory usage: 5.9 MB

In [79]:
df.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83487 entries, 1 to 83487
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Date                83487 non-null  datetime64[ns]
 1   Transactions_count  83487 non-null  int64
 2   Store_number        83487 non-null  int64
 3   pct_to_target       83487 non-null  float64
 4   met_target          83487 non-null  bool
 5   bonus_payable       83487 non-null  int64
 6   month               83487 non-null  int32
 7   seasonal_bonus      8229 non-null   object
dtypes: bool(1), datetime64[ns](1), float64(1), int32(1), int64(3), object(1)
memory usage: 5.9 MB

In [80]:
df["pct_to_target"]

1        0.8444
2        0.9432
3        1.3948
4        0.7688
5        0.7612
          ...
83483    1.1216
83484    0.6292
83485    0.9020
83486    0.3728
83487    0.3208
Name: pct_to_target, Length: 83487, dtype: float64

In [81]:
df2 = df.copy()

In [82]:
df2["month"].iloc[0] = np.nan

C:\Users\ZF915FC\AppData\Local\Temp\ipykernel_31008\3509035416.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df2["month"].iloc[0] = np.nan
C:\Users\ZF915FC\AppData\Local\Temp\ipykernel_31008\3509035416.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2["month"].iloc[0] = np.nan

In [83]:
df.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83487 entries, 1 to 83487
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Date                83487 non-null  datetime64[ns]
 1   Transactions_count  83487 non-null  int64
 2   Store_number        83487 non-null  int64
 3   pct_to_target       83487 non-null  float64
 4   met_target          83487 non-null  bool
 5   bonus_payable       83487 non-null  int64
 6   month               83487 non-null  int32
 7   seasonal_bonus      8229 non-null   object
dtypes: bool(1), datetime64[ns](1), float64(1), int32(1), int64(3), object(1)
memory usage: 5.9 MB

In [84]:
df.groupby("Store_number")[["Transactions_count"]].sum().sort_values("Transactions_count",ascending=False).iloc[:10]

              Transactions_count
Store_number
44                       7273093
47                       6535810
45                       6201115
46                       5990113
3                        5366350
48                       5107785
8                        4637971
49                       4574103
50                       4384444
11                       3972488

In [85]:
df.groupby(["Store_number","month"],as_index=False)[["Transactions_count"]].sum().sort_values(["month","Transactions_count"],ascending=[True,False])

     Store_number  month  Transactions_count
516            44      1              628438
552            47      1              568824
528            45      1              538370
540            46      1              522763
24              3      1              463260
..            ...    ...                 ...
383            32     12               86167
251            21     12               84128
503            42     12               76741
347            29     12               76627
263            22     12               50650

[641 rows x 3 columns]

In [92]:
# grouped = (
#     df.groupby(["Store_number", "month"])
#     .agg({"Transactions_count": ["sum", "mean"]})
#     .sort_values(by=["month", ("transactions_count", "sum")], ascending=[True, False])
# )
grouped = df.groupby(["Store_number","month"]).agg({"Transactions_count":["sum","mean"]})

In [98]:
grouped.sort_values(by=["month",("Transactions_count","sum")], ascending=[True,False], inplace=True)

In [117]:
df

,Date,Transactions_count,Store_number,pct_to_target,met_target,bonus_payable,month,seasonal_bonus
1,2013-01-02,2111,1,0.8444,False,0,1,None
2,2013-01-02,2358,2,0.9432,False,0,1,None
3,2013-01-02,3487,3,1.3948,True,100,1,None
4,2013-01-02,1922,4,0.7688,False,0,1,None
5,2013-01-02,1903,5,0.7612,False,0,1,None
...,...,...,...,...,...,...,...,...
83483,2017-08-15,2804,50,1.1216,True,100,8,None
83484,2017-08-15,1573,51,0.6292,False,0,8,None
83485,2017-08-15,2255,52,0.9020,False,0,8,None
83486,2017-08-15,932,53,0.3728,False,0,8,None
83487,2017-08-15,802,54,0.3208,False,0,8,NaN

In [122]:
df.groupby("Store_number").agg({"met_target":"mean","bonus_payable":"sum"}).sort_values(by="bonus_payable",ascending=False).head()

              met_target  bonus_payable
Store_number
47              0.999404         167600
44              0.998807         167500
45              0.997615         167300
3               0.998210         167300
46              0.989267         165900

In [123]:
df.groupby("month").agg({"met_target":"mean","bonus_payable":"sum"}).sort_values(by="bonus_payable",ascending=False).head()

       met_target  bonus_payable
month
12       0.255640         154100
5        0.170792         131800
3        0.169461         130400
4        0.174469         129700
7        0.162486         126300

In [139]:
df.groupby(["Store_number","month"]).sum()

In [142]:
df["month"].sum()

521031

In [145]:
df["store_month_avg_trans"] = df.groupby(["Store_number","month"])["Transactions_count"].transform("mean")

In [147]:
df["trans_vs_avg"] = df["Transactions_count"] - df["store_month_avg_trans"]

In [156]:
pivot = pd.pivot_table(data=df,index="Store_number",columns="month",values="bonus_payable",aggfunc="mean").iloc[:11]

In [166]:
pivot.loc[(pivot.sum(axis=1) > 0)]

month,1,2,3,4,5,6,7,8,9,10,11,12
Store_number,,,,,,,,,,,,
1,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,9.166667
2,0.000000,0.000000,0.000000,0.666667,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,23.333333
3,100.000000,99.290780,100.000000,100.000000,100.000000,100.000000,99.354839,100.000000,100.000000,99.193548,100.000000,100.000000
4,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,10.833333
5,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,9.166667
6,0.000000,0.000000,0.000000,0.000000,1.935484,0.666667,0.000000,0.000000,0.000000,0.000000,0.000000,22.500000
7,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,10.000000
8,90.476190,84.397163,88.387097,90.666667,86.451613,87.333333,87.096774,86.330935,91.666667,87.903226,90.000000,97.500000
9,4.761905,4.255319,9.032258,12.000000,14.838710,7.333333,2.580645,3.597122,7.500000,8.870968,8.333333,42.500000
11,27.210884,31.914894,30.322581,34.000000,27.741935,25.333333,15.483871,23.741007,28.333333,24.193548,27.500000,65.833333

In [171]:
pivot[pivot.apply(lambda x: (x > 0).sum() > 1, axis=1)]

month,1,2,3,4,5,6,7,8,9,10,11,12
Store_number,,,,,,,,,,,,
2,0.000000,0.000000,0.000000,0.666667,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,23.333333
3,100.000000,99.290780,100.000000,100.000000,100.000000,100.000000,99.354839,100.000000,100.000000,99.193548,100.000000,100.000000
6,0.000000,0.000000,0.000000,0.000000,1.935484,0.666667,0.000000,0.000000,0.000000,0.000000,0.000000,22.500000
8,90.476190,84.397163,88.387097,90.666667,86.451613,87.333333,87.096774,86.330935,91.666667,87.903226,90.000000,97.500000
9,4.761905,4.255319,9.032258,12.000000,14.838710,7.333333,2.580645,3.597122,7.500000,8.870968,8.333333,42.500000
11,27.210884,31.914894,30.322581,34.000000,27.741935,25.333333,15.483871,23.741007,28.333333,24.193548,27.500000,65.833333

In [181]:
mask = (pivot > 0).sum(axis=1) > 1

In [189]:
pivot

month,1,2,3,4,5,6,7,8,9,10,11,12
Store_number,,,,,,,,,,,,
2,0.000000,0.000000,0.000000,0.666667,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,23.333333
3,100.000000,99.290780,100.000000,100.000000,100.000000,100.000000,99.354839,100.000000,100.000000,99.193548,100.000000,100.000000
6,0.000000,0.000000,0.000000,0.000000,1.935484,0.666667,0.000000,0.000000,0.000000,0.000000,0.000000,22.500000
8,90.476190,84.397163,88.387097,90.666667,86.451613,87.333333,87.096774,86.330935,91.666667,87.903226,90.000000,97.500000
9,4.761905,4.255319,9.032258,12.000000,14.838710,7.333333,2.580645,3.597122,7.500000,8.870968,8.333333,42.500000
11,27.210884,31.914894,30.322581,34.000000,27.741935,25.333333,15.483871,23.741007,28.333333,24.193548,27.500000,65.833333

In [192]:
pd.melt(pivot.reset_index(), id_vars=['Store_number'], var_name='month', value_name='value')

    Store_number month       value
0              2     1    0.000000
1              3     1  100.000000
2              6     1    0.000000
3              8     1   90.476190
4              9     1    4.761905
..           ...   ...         ...
67             3    12  100.000000
68             6    12   22.500000
69             8    12   97.500000
70             9    12   42.500000
71            11    12   65.833333

[72 rows x 3 columns]